HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxDsadc_bf.h
/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.SCWC */
#define IFX_DSADC_CH_DICFG_SCWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.SCWC */
#define IFX_DSADC_CH_DICFG_SCWC_OFF (31)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.STROBE */
#define IFX_DSADC_CH_DICFG_STROBE_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.STROBE */
#define IFX_DSADC_CH_DICFG_STROBE_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.STROBE */
#define IFX_DSADC_CH_DICFG_STROBE_OFF (20)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.TRSEL */
#define IFX_DSADC_CH_DICFG_TRSEL_LEN (3)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.TRSEL */
#define IFX_DSADC_CH_DICFG_TRSEL_MSK (0x7)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.TRSEL */
#define IFX_DSADC_CH_DICFG_TRSEL_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.TRWC */
#define IFX_DSADC_CH_DICFG_TRWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.TRWC */
#define IFX_DSADC_CH_DICFG_TRWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.TRWC */
#define IFX_DSADC_CH_DICFG_TRWC_OFF (15)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.TSTRMODE */
#define IFX_DSADC_CH_DICFG_TSTRMODE_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.TSTRMODE */
#define IFX_DSADC_CH_DICFG_TSTRMODE_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.TSTRMODE */
#define IFX_DSADC_CH_DICFG_TSTRMODE_OFF (10)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.AFSC */
#define IFX_DSADC_CH_FCFGA_AFSC_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.AFSC */
#define IFX_DSADC_CH_FCFGA_AFSC_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.AFSC */
#define IFX_DSADC_CH_FCFGA_AFSC_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.CFAC */
#define IFX_DSADC_CH_FCFGA_CFAC_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.CFAC */
#define IFX_DSADC_CH_FCFGA_CFAC_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.CFAC */
#define IFX_DSADC_CH_FCFGA_CFAC_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.CFADCNT */
#define IFX_DSADC_CH_FCFGA_CFADCNT_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.CFADCNT */
#define IFX_DSADC_CH_FCFGA_CFADCNT_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.CFADCNT */
#define IFX_DSADC_CH_FCFGA_CFADCNT_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.CFADF */
#define IFX_DSADC_CH_FCFGA_CFADF_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.CFADF */
#define IFX_DSADC_CH_FCFGA_CFADF_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.CFADF */
#define IFX_DSADC_CH_FCFGA_CFADF_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.EGT */
#define IFX_DSADC_CH_FCFGA_EGT_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.EGT */
#define IFX_DSADC_CH_FCFGA_EGT_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.EGT */
#define IFX_DSADC_CH_FCFGA_EGT_OFF (14)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.ESEL */
#define IFX_DSADC_CH_FCFGA_ESEL_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.ESEL */
#define IFX_DSADC_CH_FCFGA_ESEL_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.ESEL */
#define IFX_DSADC_CH_FCFGA_ESEL_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.SRGA */
#define IFX_DSADC_CH_FCFGA_SRGA_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.SRGA */
#define IFX_DSADC_CH_FCFGA_SRGA_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.SRGA */
#define IFX_DSADC_CH_FCFGA_SRGA_OFF (10)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.CFEN */
#define IFX_DSADC_CH_FCFGC_CFEN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.CFEN */
#define IFX_DSADC_CH_FCFGC_CFEN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.CFEN */
#define IFX_DSADC_CH_FCFGC_CFEN_OFF (10)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.CFMC */
#define IFX_DSADC_CH_FCFGC_CFMC_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.CFMC */
#define IFX_DSADC_CH_FCFGC_CFMC_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.CFMC */
#define IFX_DSADC_CH_FCFGC_CFMC_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.CFMDCNT */
#define IFX_DSADC_CH_FCFGC_CFMDCNT_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.CFMDCNT */
#define IFX_DSADC_CH_FCFGC_CFMDCNT_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.CFMDCNT */
#define IFX_DSADC_CH_FCFGC_CFMDCNT_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.CFMDF */
#define IFX_DSADC_CH_FCFGC_CFMDF_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.CFMDF */
#define IFX_DSADC_CH_FCFGC_CFMDF_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.CFMDF */
#define IFX_DSADC_CH_FCFGC_CFMDF_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.CFMSV */
#define IFX_DSADC_CH_FCFGC_CFMSV_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.CFMSV */
#define IFX_DSADC_CH_FCFGC_CFMSV_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.CFMSV */
#define IFX_DSADC_CH_FCFGC_CFMSV_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.MFSC */
#define IFX_DSADC_CH_FCFGC_MFSC_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.MFSC */
#define IFX_DSADC_CH_FCFGC_MFSC_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.MFSC */
#define IFX_DSADC_CH_FCFGC_MFSC_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.SRGM */
#define IFX_DSADC_CH_FCFGC_SRGM_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.SRGM */
#define IFX_DSADC_CH_FCFGC_SRGM_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.SRGM */
#define IFX_DSADC_CH_FCFGC_SRGM_OFF (14)

/** \\brief  Length for Ifx_DSADC_CH_FCFGM_Bits.DSH */
#define IFX_DSADC_CH_FCFGM_DSH_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGM_Bits.DSH */
#define IFX_DSADC_CH_FCFGM_DSH_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGM_Bits.DSH */
#define IFX_DSADC_CH_FCFGM_DSH_OFF (3)

/** \\brief  Length for Ifx_DSADC_CH_FCFGM_Bits.FIR0EN */
#define IFX_DSADC_CH_FCFGM_FIR0EN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGM_Bits.FIR0EN */
#define IFX_DSADC_CH_FCFGM_FIR0EN_MSK (0x1)

