HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxDsadc_bf.h
/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_OFF (18)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_OFF (19)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV4 */
#define IFX_DSADC_EVFLAG_ALEV4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV4 */
#define IFX_DSADC_EVFLAG_ALEV4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV4 */
#define IFX_DSADC_EVFLAG_ALEV4_OFF (20)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV5 */
#define IFX_DSADC_EVFLAG_ALEV5_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV5 */
#define IFX_DSADC_EVFLAG_ALEV5_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV5 */
#define IFX_DSADC_EVFLAG_ALEV5_OFF (21)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_OFF (0)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV1 */
#define IFX_DSADC_EVFLAG_RESEV1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV1 */
#define IFX_DSADC_EVFLAG_RESEV1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV1 */
#define IFX_DSADC_EVFLAG_RESEV1_OFF (1)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_OFF (2)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_OFF (3)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV4 */
#define IFX_DSADC_EVFLAG_RESEV4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV4 */
#define IFX_DSADC_EVFLAG_RESEV4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV4 */
#define IFX_DSADC_EVFLAG_RESEV4_OFF (4)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV5 */
#define IFX_DSADC_EVFLAG_RESEV5_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV5 */
#define IFX_DSADC_EVFLAG_RESEV5_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV5 */
#define IFX_DSADC_EVFLAG_RESEV5_OFF (5)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_OFF (16)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_DSADC_EVFLAGCLR_ALEC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_DSADC_EVFLAGCLR_ALEC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_DSADC_EVFLAGCLR_ALEC1_OFF (17)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_OFF (18)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_OFF (19)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_DSADC_EVFLAGCLR_ALEC4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_DSADC_EVFLAGCLR_ALEC4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_DSADC_EVFLAGCLR_ALEC4_OFF (20)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_DSADC_EVFLAGCLR_ALEC5_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_DSADC_EVFLAGCLR_ALEC5_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_DSADC_EVFLAGCLR_ALEC5_OFF (21)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_OFF (0)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC1 */
#define IFX_DSADC_EVFLAGCLR_RESEC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC1 */
#define IFX_DSADC_EVFLAGCLR_RESEC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC1 */
#define IFX_DSADC_EVFLAGCLR_RESEC1_OFF (1)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_OFF (2)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_OFF (3)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC4 */
#define IFX_DSADC_EVFLAGCLR_RESEC4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC4 */
#define IFX_DSADC_EVFLAGCLR_RESEC4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC4 */
#define IFX_DSADC_EVFLAGCLR_RESEC4_OFF (4)

