HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxDsadc_bf.h
/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_DSADC_EVFLAGCLR_RESEC5_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_DSADC_EVFLAGCLR_RESEC5_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_DSADC_EVFLAGCLR_RESEC5_OFF (5)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_LEN (4)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_OFF (22)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_OFF (11)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_OFF (12)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_OFF (13)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_OFF (20)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_LEN (3)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_MSK (0x7)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_OFF (23)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_OFF (1)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_OFF (2)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_OFF (3)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_OFF (4)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_OFF (5)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_OFF (17)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_OFF (18)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_OFF (19)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_OFF (20)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_OFF (21)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MOD_REV */
#define IFX_DSADC_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_DSADC_ID_Bits.MOD_REV */
#define IFX_DSADC_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_ID_Bits.MOD_REV */
#define IFX_DSADC_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MOD_TYPE */
#define IFX_DSADC_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_DSADC_ID_Bits.MOD_TYPE */
#define IFX_DSADC_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_ID_Bits.MOD_TYPE */
#define IFX_DSADC_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_LEN (1)

