HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxDsadc_bf.h
/** \\brief  Mask for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_OFF (29)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDSADC_BF_H */
